tutorials/FF/dambreak/interFoam-interFoam_bidirectional/Fluid2/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Fluid2;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid2-Mesh;
    patches           (leftWall_inlet);

    readData
    (
      Velocity
      Alpha
      PrghGradient
    );

    writeData
    (
        Prgh
    );
  };
};
